// 1
// Получить число pi из Math и округлить его до 2-х знаков после точки

const pi = (Math.PI); // создаем констаниту ПИ
console.log(pi.toFixed(2)); // выводим в консоль и добавляем параметр to.Fixed указывая в скобках, сколько чисел нам нужно оставить после запятой

// 2
// Используя Math, найти максимальное и минимальное числа из представленного ряда 15, 11, 16, 12, 51, 12, 13, 51

let mas = [15, 11, 16, 12, 51, 12, 13, 51] // создаем масив
console.log(mas); // выводим масив для просмотра
console.log(Math.max(...mas)); // с помощью Math.max and Math.min 
console.log(Math.min(...mas)); // выводим макс. и мин. число

// 3
//Работа с Math.random:

//Получить случайное число и округлить его до двух цифр после запятой
//Получить случайное целое число от 0 до X. X - любое произвольное число.

// 3.1
let randomNumber = Math.random(); //Math.random выдает рандомное число и фиксим его
console.log(randomNumber.toFixed(2)); // 

// 3.2
console.log(Math.ceil(Math.random() * 10001));

// 4
let Sum = (0.6 + 0.7);
console.log(Sum.toFixed(1));


// 5 Получить число из строки ‘100$’
let a = Number("100$".replace(/\D+/g, ""));
console.log(a);